; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph7 - mode
	infrared2 - mode
	spectrograph8 - mode
	infrared5 - mode
	image6 - mode
	infrared0 - mode
	image1 - mode
	image4 - mode
	thermograph3 - mode
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star2 - direction
	GroundStation1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image4)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph3)
	(supports instrument0 image6)
	(supports instrument0 infrared5)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared2)
	(supports instrument1 image4)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph8)
	(supports instrument1 thermograph7)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Star11)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon6 thermograph3)
	(have_image Planet7 infrared0)
	(have_image Planet7 infrared5)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon8 infrared2)
	(have_image Phenomenon8 infrared5)
	(have_image Star9 thermograph3)
	(have_image Star9 image1)
	(have_image Planet10 image4)
	(have_image Planet10 spectrograph8)
	(have_image Planet10 image6)
	(have_image Star11 spectrograph8)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 14
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 14
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 14
4. (turn_to satellite0 star9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star9)
   goals met: 0 of 14
5. (take_image satellite0 star9 instrument0 thermograph3)
   added: (have_image star9 thermograph3)
   goals met: 1 of 14
6. (turn_to satellite0 planet7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet7)
   goals met: 1 of 14
7. (take_image satellite0 planet7 instrument0 infrared5)
   added: (have_image planet7 infrared5)
   goals met: 2 of 14
8. (turn_to satellite0 planet10 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet10)
   goals met: 2 of 14
9. (take_image satellite0 planet10 instrument0 image6)
   added: (have_image planet10 image6)
   goals met: 3 of 14
10. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 14
11. (take_image satellite0 phenomenon8 instrument0 infrared5)
   added: (have_image phenomenon8 infrared5)
   goals met: 4 of 14
12. (turn_to satellite0 phenomenon6 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 14
13. (take_image satellite0 phenomenon6 instrument0 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   goals met: 5 of 14
14. (turn_to satellite0 groundstation1 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation1)
   goals met: 5 of 14
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 5 of 14
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 14
17. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 5 of 14
18. (turn_to satellite0 phenomenon6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon6)
   goals met: 5 of 14
19. (take_image satellite0 phenomenon6 instrument1 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 6 of 14
20. (turn_to satellite0 phenomenon8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 14
21. (take_image satellite0 phenomenon8 instrument1 image1)
   added: (have_image phenomenon8 image1)
   goals met: 7 of 14
22. (take_image satellite0 phenomenon8 instrument1 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 8 of 14
23. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 8 of 14
24. (take_image satellite0 planet10 instrument1 image4)
   added: (have_image planet10 image4)
   goals met: 9 of 14
25. (take_image satellite0 planet10 instrument1 spectrograph8)
   added: (have_image planet10 spectrograph8)
   goals met: 10 of 14
26. (turn_to satellite0 planet7 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet7)
   goals met: 10 of 14
27. (take_image satellite0 planet7 instrument1 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 11 of 14
28. (turn_to satellite0 star9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star9)
   goals met: 11 of 14
29. (take_image satellite0 star9 instrument1 image1)
   added: (have_image star9 image1)
   goals met: 12 of 14
30. (turn_to satellite0 star11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star11)
   goals met: 13 of 14
31. (take_image satellite0 star11 instrument1 spectrograph8)
   added: (have_image star11 spectrograph8)
   goals met: 14 of 14
